Project/Toir/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/ПеремещениеТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Накладная на перемещение
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НакладнаяНаПеремещение";
	КомандаПечати.Представление = НСтр("es='La factura al traslado';ru='Накладная на перемещение';en='Waybill for moving'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаПеремещение") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"НакладнаяНаПеремещение",
			НСтр("es='La factura al traslado';ru='Накладная на перемещение';en='Waybill for moving'"),
			СформироватьПечатнуюФормуНакладнойНаПеремещениеТоваров(МассивОбъектов, ОбъектыПечати),
			,
		    "Документ.ПеремещениеТоваров.ПФ_MXL_НакладнаяНаПеремещение");
		
	КонецЕсли;
	
	//ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной.
//
Функция СформироватьПечатнуюФормуНакладнойНаПеремещениеТоваров(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_Накладная";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеТоваров.ПФ_MXL_НакладнаяНаПеремещение");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документы", МассивОбъектов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваров.Организация КАК Организация,
	               |	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
	               |	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
	               |	ПеремещениеТоваров.Номер КАК Номер,
	               |	ПеремещениеТоваров.Дата КАК Дата,
	               |	ПеремещениеТоваров.Ссылка КАК Документ,
	               |	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	ПеремещениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	               |	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	               |	ПеремещениеТоваровТовары.Серия КАК Серия,
	               |	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КолУп,
	               |	ПеремещениеТоваровТовары.Количество КАК Количество,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	               |	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
	               |	ПеремещениеТоваровТовары.Упаковка КАК Упаковка,
	               |	ПеремещениеТоваровТовары.Характеристика.Наименование КАК НаименованиеХарактеристики
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО ПеремещениеТоваровТовары.Ссылка = ПеремещениеТоваров.Ссылка
	               |ГДЕ
	               |	ПеремещениеТоваров.Ссылка В(&Документы)
	               |ИТОГИ
	               |	МАКСИМУМ(Организация),
	               |	МАКСИМУМ(СкладОтправитель),
	               |	МАКСИМУМ(СкладПолучатель),
	               |	МАКСИМУМ(Номер),
	               |	МАКСИМУМ(Дата)
	               |ПО
	               |	Документ";
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Если НЕ ЭтоПервый Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ОбластьЗаголовкаПеремещение         = Макет.ПолучитьОбласть("ЗаголовокПеремещение");
		ОбластьЗаголовкаПеремещение.Параметры.Организация = ВыборкаДокумент.Организация;
		ОбластьЗаголовкаПеремещение.Параметры.СкладОтправитель = ВыборкаДокумент.СкладОтправитель;
		ОбластьЗаголовкаПеремещение.Параметры.СкладПолучатель = ВыборкаДокумент.СкладПолучатель;
		ОбластьЗаголовкаПеремещение.Параметры.Дата = ВыборкаДокумент.Дата;
		ОбластьЗаголовкаПеремещение.Параметры.Номер = ВыборкаДокумент.Номер;
		ТабличныйДокумент.Вывести(ОбластьЗаголовкаПеремещение);
				
		ВыборкаТоваров = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
		ИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
		
		Если ИспользоватьХарактеристики И НЕ ИспользоватьСерии Тогда  
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицыФО");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыФО");
			ОбластьШапка.Параметры.ЗаголовокКолонки = "Характеристика";
		ИначеЕсли ИспользоватьСерии И НЕ ИспользоватьХарактеристики Тогда
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицыФО");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыФО");
			ОбластьШапка.Параметры.ЗаголовокКолонки = "Серия";
		ИначеЕсли ИспользоватьХарактеристики И ИспользоватьСерии Тогда
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицыФО");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицыФО");
			ОбластьШапка.Параметры.ЗаголовокКолонки = "Характеристика, серия";
		Иначе 
			ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		КонецЕсли;
		ОбластьПодвал     = Макет.ПолучитьОбласть("ПодвалТаблицы");

		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Пока ВыборкаТоваров.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
						
			ТоварыХарактеристика = "";
			ТоварыСерия = "";
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
			Если ИспользоватьХарактеристики Тогда  
				ТоварыХарактеристика = ?(ЗначениеЗаполнено(ВыборкаТоваров.Характеристика),ВыборкаТоваров.Характеристика, 
				                          ?(ЗначениеЗаполнено(ВыборкаТоваров.НаименованиеХарактеристики),ВыборкаТоваров.НаименованиеХарактеристики,""));
			КонецЕсли;
			Если ИспользоватьСерии Тогда
				ТоварыСерия = ?(ЗначениеЗаполнено(ВыборкаТоваров.Серия), ВыборкаТоваров.Серия, "");
			КонецЕсли;
			Если ЗначениеЗаполнено(ТоварыХарактеристика) И ЗначениеЗаполнено(ТоварыСерия) Тогда
				ОбластьСтрока.Параметры.ХарактеристикаСерия = Строка(ТоварыХарактеристика) + ", " + Строка(ТоварыСерия);
			ИначеЕсли ИспользоватьХарактеристики ИЛИ ИспользоватьСерии Тогда 
				ОбластьСтрока.Параметры.ХарактеристикаСерия = Строка(ТоварыХарактеристика) + Строка(ТоварыСерия);
			КонецЕсли;
							
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
					
		Подписи = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(Подписи);
		
	КонецЦикла;
		
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции

// Функция возвращает таблицу реквизитов, зависимых от хозяйственной операции документа.
//
Функция ПолучитьМассивыРеквизитов( МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;
	
КонецФункции
#КонецОбласти

#КонецЕсли
